#include "translate.hpp"

// Содержит словарь с парами символов и соответствующих им последовательностей точек и тире
std::map<char, std::string> morse_alphabet {
	{'a', ".-"},
	{'b', "-..."},
	{'c', "-.-."},
	{'d', "-.."},
	{'e', "."},
	{'f', "..-."},
	{'g', "--."},
	{'h', "...."},
	{'i', ".."},
	{'j', ".---"},
	{'k', "-.-"},
	{'l', ".-.."},
	{'m', "--"},
	{'n', "-."},
	{'o', "---"},
	{'p', ".--."},
	{'q', "--.-"},
	{'r', ".-."},
	{'s', "..."},
	{'t', "-"},
	{'u', "..-"},
	{'v', "...-"},
	{'w', ".--"},
	{'x', "-..-"},
	{'y', "-.--"},
	{'z', "--.."},
	{'0', "-----"},
	{'1', ".----"},
	{'2', "..---"},
	{'3', "...--"},
	{'4', "....-"},
	{'5', "....."},
	{'6', "-...."},
	{'7', "--..."},
	{'8', "---.."},
	{'9', "----."},
	{' ', "/"}
};

// Кодирует строку с латинскими символами и числами в азбуку морзе
std::string encode_string(std::string input) {

	// Содержит строку, возвращаемую функцией, к которой последовательно добавляются подстроки
 	std::string output;

	for (char character : input) {

		// Символ кодируется в азбуку морзе функцией encode_character()
		std::string encoded_character = encode_character(character);
		if (encoded_character != "") output += encoded_character + " ";
	}
	// Тело цикла повторяется для каждого символа

	return output;
}

std::string encode_character(char input) {
	
	// Символ переводится в нижний регистр
	// Таким образом создание алфавита для верхнего регистра можно избежать
	input = (char)std::tolower(input);

	if (morse_alphabet.count(input) == 0) return "";
	else return morse_alphabet[input];
}